       IDENTIFICATION DIVISION.
       PROGRAM-ID. SCENE-SDF.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 LHS COMP-1.
       01 RHS COMP-1.

       01 V.
         02 V-VALS COMP-1 OCCURS 3 TIMES.

       LINKAGE SECTION.
       01 WORLD-POS.
         02 WORLD-POS-VALS COMP-1 OCCURS 3 TIMES.
       01 SDF COMP-1.

       PROCEDURE DIVISION USING WORLD-POS, SDF.
       MAIN-PROCEDURE.

           CALL 'SDF-SPHERE' USING WORLD-POS, LHS

           MOVE 0 TO V-VALS(1)
           MOVE 0.6 TO V-VALS(2)
           MOVE 0.6 TO V-VALS(3)

           CALL 'SDF-TRANSLATE' USING WORLD-POS, V, WORLD-POS

           MOVE 0.6 TO V-VALS(1)
           MOVE 0.4 TO V-VALS(2)
           MOVE 0.3 TO V-VALS(3)

           CALL 'SDF-BOX' USING WORLD-POS, V, RHS
           CALL 'COMBINE-SUB' USING RHS, LHS, SDF

       .
       END PROGRAM SCENE-SDF.
