       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDF-SPHERE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 WORLD-POS.
         02 WORLD-POS-VALS COMP-1 OCCURS 3 TIMES.
       01 RADIUS COMP-1.
       01 RESULT COMP-1.

       PROCEDURE DIVISION USING WORLD-POS, RADIUS, RESULT.
       MAIN-PROCEDURE.

         CALL 'V3-LEN' USING WORLD-POS, RESULT
         SUBTRACT RADIUS FROM RESULT.

       END PROGRAM SDF-SPHERE.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDF-BOX.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEMP.
         02 TEMP-VALS COMP-1 OCCURS 3 TIMES.
       01 RHS COMP-1.
       01 Z.
         02 Z-VALS COMP-1 OCCURS 3 TIMES VALUE 0.0.
       LINKAGE SECTION.
       01 WORLD-POS.
         02 WORLD-POS-VALS COMP-1 OCCURS 3 TIMES.
       01 BOUNDS.
         02 BOUNDS-VALS COMP-1 OCCURS 3 TIMES.
       01 RESULT COMP-1.

       PROCEDURE DIVISION USING WORLD-POS, BOUNDS, RESULT.
       MAIN-PROCEDURE.

           CALL 'V3-ABS' USING WORLD-POS, TEMP
           CALL 'V3-SUB' USING TEMP, BOUNDS, TEMP

           MOVE FUNCTION MAX (TEMP-VALS(1), TEMP-VALS(2)) TO RHS
           MOVE FUNCTION MAX (TEMP-VALS(3), RHS) TO RHS
           MOVE FUNCTION MIN (RHS, 0.0) TO RHS

           CALL 'V3-MAX' USING TEMP, Z, TEMP
           CALL 'V3-LEN' USING TEMP, RESULT

           ADD RHS TO RESULT
           .
       END PROGRAM SDF-BOX.



      *TRANSFORM

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SDF-TRANSLATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NEGATE.
         02 NEGATE-VALS COMP-1 OCCURS 3 TIMES VALUE -1.0.
       LINKAGE SECTION.
       01 WORLD-POS.
         02 WORLD-POS-VALS COMP-1 OCCURS 3 TIMES.
       01 TRANSLATION.
         02 TRANSLATION-POS-VALS COMP-1 OCCURS 3 TIMES.
       01 RESULT.
         02 RESULT-POS-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING WORLD-POS, TRANSLATION, RESULT.
       MAIN-PROCEDURE.
           CALL 'V3-SUB' USING WORLD-POS, TRANSLATION, RESULT.
       END PROGRAM SDF-TRANSLATE.



      *cOMBINATIONS

       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMBINE-ADD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 D1 COMP-1.
       01 D2 COMP-1.
       01 R COMP-1.

       PROCEDURE DIVISION USING D1, D2, R.
       MAIN-PROCEDURE.
           COMPUTE R = FUNCTION MIN(D1, D2).
       END PROGRAM COMBINE-ADD.



       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMBINE-SUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 D1 COMP-1.
       01 D2 COMP-1.
       01 R COMP-1.

       PROCEDURE DIVISION USING D1, D2, R.
       MAIN-PROCEDURE.
           COMPUTE R = FUNCTION MAX(-1.0 * D1, D2).
       END PROGRAM COMBINE-SUB.



       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMBINE-INTERSECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 D1 COMP-1.
       01 D2 COMP-1.
       01 R COMP-1.

       PROCEDURE DIVISION USING D1, D2, R.
       MAIN-PROCEDURE.
           COMPUTE R = FUNCTION MAX(D1, D2).
       END PROGRAM COMBINE-INTERSECT.
