      *=================================================================
      *VECTOR NONSENSE==================================================
      *=================================================================
       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-ADD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 B.
       02 B-VALS COMP-1 OCCURS 3 TIMES.
       01 R.
       02 R-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING A,B,R.
       MAIN-PROCEDURE.

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
       COMPUTE R-VALS(I) = A-VALS(I) + B-VALS(I)
       END-PERFORM.

       END PROGRAM V3-ADD.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-SUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 B.
       02 B-VALS COMP-1 OCCURS 3 TIMES.
       01 R.
       02 R-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING A,B,R.
       MAIN-PROCEDURE.

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
       COMPUTE R-VALS(I) = A-VALS(I) - B-VALS(I)
       END-PERFORM.

       END PROGRAM V3-SUB.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-MUL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 B.
       02 B-VALS COMP-1 OCCURS 3 TIMES.
       01 R.
       02 R-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING A,B,R.
       MAIN-PROCEDURE.

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
       COMPUTE R-VALS(I) = A-VALS(I) * B-VALS(I)
       END-PERFORM.

       END PROGRAM V3-MUL.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-DIV.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 B.
       02 B-VALS COMP-1 OCCURS 3 TIMES.
       01 R.
       02 R-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING A,B,R.
       MAIN-PROCEDURE.

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
       COMPUTE R-VALS(I) = A-VALS(I) / B-VALS(I)
       END-PERFORM.

       END PROGRAM V3-DIV.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-DOT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 B.
       02 B-VALS COMP-1 OCCURS 3 TIMES.
       01 R COMP-1.

       PROCEDURE DIVISION USING A,B,R.
       MAIN-PROCEDURE.
       MOVE 0.0 TO R
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
       COMPUTE R = R + (A-VALS(I) * B-VALS(I))
       END-PERFORM.

       END PROGRAM V3-DOT.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-MUL-S.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 B COMP-1.
       01 R.
       02 R-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING A,B,R.
       MAIN-PROCEDURE.

       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
       COMPUTE R-VALS(I) = A-VALS(I) * B
       END-PERFORM.

       END PROGRAM V3-MUL-S.


       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-LEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 R COMP-1.

       PROCEDURE DIVISION USING A,R.
       MAIN-PROCEDURE.
       MOVE 0.0 TO R
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
         COMPUTE R = R + (A-VALS(I) * A-VALS(I))
       END-PERFORM.
         COMPUTE R = FUNCTION SQRT(R).

       END PROGRAM V3-LEN.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. V3-NORM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 I PIC 9(9) COMP.
       01 LEN COMP-1.
       LINKAGE SECTION.
       01 A.
       02 A-VALS COMP-1 OCCURS 3 TIMES.
       01 R.
       02 R-VALS COMP-1 OCCURS 3 TIMES.

       PROCEDURE DIVISION USING A,R.
       MAIN-PROCEDURE.

       CALL 'V3-LEN' USING A, LEN
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
         COMPUTE R-VALS(I) = A-VALS(I) / LEN
       END-PERFORM.

       END PROGRAM V3-NORM.
