      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRITE-BITMAP.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BINARY-FILE ASSIGN USING FILE-PATH
               ORGANISATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD BINARY-FILE EXTERNAL.
       01 BINARY-DATA PIC X.

       WORKING-STORAGE SECTION.
           01 HEADER-SIZE PIC 9(9) COMP.
           01 FILE-SIZE PIC 9(9) COMP.
           77 FILE-PATH PIC X(80).

           01 X PIC 9(9) COMP.
           01 Y PIC 9(9) COMP.

           01 FIX-BROKEN-GARBAGE PIC 9(9) COMP.
           01 FIX-BROKEN-GARBAGE-SHORT PIC 9(4) COMP.

       LINKAGE SECTION.
       01 BITMAP-IMAGE.
           05 IMAGE-WIDTH PIC 9(9) COMP.
           05 IMAGE-HEIGHT PIC 9(9) COMP.
           05 IMAGE-PIXELS PIC 9(9) COMP.
           05 IMAGE-BYTES PIC 9(9) COMP.

           05 IMAGE-ROWS OCCURS 1 TO 256 TIMES DEPENDING ON IMAGE-WIDTH.
           10 IMAGE-COLS  OCCURS 1 TO 256 TIMES
             DEPENDING ON IMAGE-HEIGHT.
           15 PIXEL-VALUE PIC XXX.

       01 FILE-NAME PIC X(80).

       PROCEDURE DIVISION USING BITMAP-IMAGE, FILE-NAME.
       MAIN-PROCEDURE.

           MOVE FILE-NAME TO FILE-PATH
           OPEN OUTPUT BINARY-FILE

           MOVE 54 TO HEADER-SIZE
           ADD IMAGE-BYTES TO HEADER-SIZE GIVING FILE-SIZE

           MOVE "B" TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE
           MOVE "M" TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE
      *FILESIZE, RESERVED, DATAOFFSET
           CALL 'WRITE-INT-TO-FILE' USING FILE-SIZE
           CALL 'WRITE-INT-TO-FILE' USING 0
           CALL 'WRITE-INT-TO-FILE' USING HEADER-SIZE

      *I DESPISE THIS EXISTANCE
           MOVE 40 TO FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE

           CALL 'WRITE-INT-TO-FILE' USING IMAGE-WIDTH
           CALL 'WRITE-INT-TO-FILE' USING IMAGE-HEIGHT
           MOVE 1 TO FIX-BROKEN-GARBAGE-SHORT
           CALL 'WRITE-SHORT-TO-FILE' USING FIX-BROKEN-GARBAGE-SHORT
           MOVE 24 TO FIX-BROKEN-GARBAGE-SHORT
           CALL 'WRITE-SHORT-TO-FILE' USING FIX-BROKEN-GARBAGE-SHORT
           MOVE 0 TO FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE
           MOVE 1024 TO FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE
           MOVE 16777216 TO FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE
           MOVE 0 TO FIX-BROKEN-GARBAGE
           CALL 'WRITE-INT-TO-FILE' USING FIX-BROKEN-GARBAGE

           PERFORM VARYING Y FROM 1 BY 1
           UNTIL Y > IMAGE-HEIGHT

             PERFORM VARYING X FROM 1 BY 1
             UNTIL X > IMAGE-WIDTH

               MOVE PIXEL-VALUE(X,Y)(1:1) TO BINARY-DATA
               WRITE BINARY-DATA
               MOVE PIXEL-VALUE(X,Y)(2:1) TO BINARY-DATA
               WRITE BINARY-DATA
               MOVE PIXEL-VALUE(X,Y)(3:1) TO BINARY-DATA
               WRITE BINARY-DATA

             END-PERFORM
           END-PERFORM

           CLOSE BINARY-FILE
           .
       END PROGRAM WRITE-BITMAP.


       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRITE-INT-TO-FILE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BINARY-FILE ASSIGN "OUT.BMP"
               ORGANISATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD BINARY-FILE EXTERNAL.
       01 BINARY-DATA PIC X.
       WORKING-STORAGE SECTION.
       01 INT-OUT-CHAR PIC XXXX.
       01 INT-OUT REDEFINES INT-OUT-CHAR PIC 9(9) COMP.
       LINKAGE SECTION.
       01 CALL_VAL PIC 9(9) COMP.
       PROCEDURE DIVISION USING CALL_VAL.
       MAIN-PROCEDURE.
           MOVE CALL_VAL TO INT-OUT

           MOVE INT-OUT-CHAR(4:1) TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE.
           MOVE INT-OUT-CHAR(3:1) TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE.
           MOVE INT-OUT-CHAR(2:1) TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE.
           MOVE INT-OUT-CHAR(1:1) TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE.

       END PROGRAM WRITE-INT-TO-FILE.


       IDENTIFICATION DIVISION.
       PROGRAM-ID. WRITE-SHORT-TO-FILE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BINARY-FILE ASSIGN "OUT.BMP"
               ORGANISATION IS SEQUENTIAL
               ACCESS IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD BINARY-FILE EXTERNAL.
       01 BINARY-DATA PIC X.
       WORKING-STORAGE SECTION.
       01 SHORT-OUT-CHAR PIC XX.
       01 SHORT-OUT REDEFINES SHORT-OUT-CHAR PIC 9(4) COMP.
       LINKAGE SECTION.
       01 CALL_VAL PIC 9(4) COMP.
       PROCEDURE DIVISION USING CALL_VAL.
       MAIN-PROCEDURE.
           MOVE CALL_VAL TO SHORT-OUT

           MOVE SHORT-OUT-CHAR(2:1) TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE.
           MOVE SHORT-OUT-CHAR(1:1) TO BINARY-DATA
           WRITE BINARY-DATA
           END-WRITE.

       END PROGRAM WRITE-SHORT-TO-FILE.
